import VersoBlog
open Verso Genre Blog

#doc (Page) " Часткова формалізація в Lean книги Аналіз I" =>

Файли в цьому каталозі містять формалізацію вибраних частин мого *(пр.перекл. тут і далі це Терренс Тао)* тексту [_Аналіз I_](https://terrytao.wordpress.com/books/analysis-i/) у [Lean](https://lean-lang.org/). Формалізація має на меті максимально точно перефразувати оригінальний текст, а також продемонструвати особливості та синтаксис Lean. Зокрема, формалізація _не_ оптимізована під ефективність, а в деяких випадках може відхилятися від ідіоматичного використання Lean.

Частини тексту, залишені як вправи для читача, у цьому перекладі передаються як тактика `sorry`. Читачі можуть створити форк репозиторію, щоб спробувати свої сили у виконанні цих вправ, але я не маю наміру розміщувати рішення безпосередньо в цьому репозиторії.

Хоча розташування визначень, теорем і доказів тут є близьким перефразуванням підручника, я утримуюся від прямого цитування матеріалу з підручника, натомість наводжу посилання на оригінальний текст, де це доречно. Таким чином, цю формалізацію слід розглядати як анотоване доповнення до основного тексту, а не як його заміну.

Значна частина матеріалу в цьому тексті продубльована у стандартній математичній бібліотеці Lean [Mathlib](https://leanprover-community.github.io/mathlib4_docs/), хоча й з дещо іншими визначеннями. Щоб усунути ці розбіжності, ця формалізація поступово переходитиме від визначень, наданих підручником, до визначень, наданих Mathlib, у міру просування в тексті, жертвуючи таким чином самодостатністю формалізації на користь сумісності з Mathlib. Наприклад, у розділі 2 розвивається теорія натуральних чисел незалежно від Mathlib, але в усіх наступних розділах замість неї використовуватимуть натуральні числа Mathlib. (Епілог до розділу 2 надається, щоб показати, що два поняття натуральних чисел ізоморфні.) Таким чином, цю формалізація також може бути використана як вступ до різних частин Mathlib.

Для узгодження формалізації з домовленостями Mathlib, до деяких визначень було внесено невелику кількість технічних змін порівняно з версією підручника. Найбільш помітні:
- Послідовності індексуються з нуля, а не з одиниці, оскільки Mathlib має набагато більше підтримки для натуральних чисел `ℕ` з нульовою нумерацією, ніж для натуральних чисел з одиничною нумерацією.
- Багатьом операціям, які залишилися невизначеними в тексті, таким як ділення на нуль або отримання формальної границі не-Коші послідовності, замість цього присвоюється "сміттєве" значення (наприклад, `0`), щоб зробити операцію повністю визначеною. Це пояснюється тим, що Lean має кращу підтримку повних функцій *(пр.перекл. total functions)*, ніж часткових функцій *(пр.перекл. partial functions)* (нерозбірливе використання останніх може призвести до "пекла залежних типів", в якому навіть дуже прості маніпуляції вимагають досить тонких і делікатних доказів). Дивіться, наприклад, [цю публікацію в блозі](https://xenaproject.wordpress.com/2020/07/05/division-by-zero-in-type-theory-a-faq/) Кевіна Баззарда для отримання додаткової інформації.

Поточні формалізовані розділи:

- [Глава 2.1: Аксіоми Пеано](./sec21/)
- [Глава 2.2: Додавання](./sec22/)
- [Глава 2.3: Множення](./sec23/)
- [Розділ 2, Епілог: Ізоморфізм із натуральними числами Mathlib](./sec2e)
- [Глава 3.1: Основи теорії множин](./sec31/)
- [Глава 3.2: Парадок Рассела](./sec32/)
- [Глава 3.3: Functions](./sec33/)
- [Глава 3.4: Images and inverse images](./sec34/)
- [Глава 3.5: Cartesian products](./sec35/)
- [Глава 3.6: Cardinality of sets](./sec36/)
- [Глава 4.1: The integers](./sec41/)
- [Глава 4.2: The rationals](./sec42/)
- [Глава 4.3: Absolute value and exponentiation](./sec43/)
- [Глава 4.4: Gaps in the rational numbers](./sec44/)
- [Глава 5.1: Cauchy sequences of rationals](./sec51)
- [Глава 5.2: Equivalent Cauchy sequences](./sec52/)
- [Глава 5.3: Construction of the real numbers](./sec53/)
- [Глава 5.4: Ordering the reals](./sec54/)
- [Глава 5.5: The least upper bound property](./sec55/)
- [Chapter 5 epilogue: Isomorphism with the Mathlib reals](./sec5e/)
- [Глава 6.1: Convergence and limit laws](./sec61/)
- [Глава 6.2: The extended real number system](./sec62/)
- [Глава 6.3: Suprema and Infima of sequences](./sec63/)
- [Глава 6.4: Lim inf, lim sup, and limit points](./sec64/)
- [Глава 6.5: Some standard limits](./sec65/)
- [Глава 6.6: Subsequences](./sec66/)
- [Глава 6 epilogue: Connections with Mathlib limits](./sec6e/)
- [Глава 7.1: Finite series](./sec71/)
- [Глава 7.2: Infinite series](./sec72/)
- [Глава 7.3: Sums of non-negative numbers](./sec73/)
- [Глава 7.4: Rearrangement of series](./sec74/)
- [Глава 7.5: The root and ratio tests](./sec75/)
- [Глава 9.1: Subsets of the real line](./sec91/)
- [Глава 9.2: The algebra of real-valued functions](./sec92/)
- [Глава 9.3: Limiting values of functions](./sec93/)
- [Глава 9.4: Continuous functions](./sec94/)
- [Глава 9.5: Left and right limits](./sec95/)
- [Глава 9.6: The maximum principle](./sec96/)
- [Глава 9.7: The intermediate value theorem](./sec97/)
- [Глава 9.8: Monotone functions](./sec98/)
- [Глава 9.9: Uniform continuity](./sec99/)
- [Глава 9.10: Limits at infinity](./sec910/)
- [Глава 10.1: Basic definitions](./sec101/)
- [Глава 10.2: Local extrema and derivatives](./sec102/)
- [Глава 10.3: Monotone functions and derivatives](./sec103/)
- [Глава 10.4: The inverse function theorem](./sec104/)
- [Глава 10.5: L'Hôpital's rule](./sec105/)
- [Глава 11.1: Partitions](./sec111/)
- [Глава 11.2: Piecewise constant functions](./sec112/)
- [Глава 11.3: Upper and lower Riemann integrals](./sec113/)
- [Додаток A.1: Математичні твердження](./secA1/)
- [Додаток A.2: Висновки](./secA2/)
- [Додаток A.3: Структура доказів](./secA3/)
- [Додаток A.4: Змінні та квантіфікатори](./secA4/)
- [Додаток A.5: Вкладені квантифікатори](./secA5/)
- [Додаток A.6: Деякі приклади доведень та квантифікаторів](./secA6/)
- [Додаток A.7: Рівність](./secA7/)
