import VersoBlog
open Verso Genre Blog

#doc (Page) " Часткова формалізація в Lean книги Аналіз I" =>

Файли в цьому каталозі містять формалізацію вибраних частин мого *(пр.перекл. тут і далі це Терренс Тао)* тексту [_Аналіз I_](https://terrytao.wordpress.com/books/analysis-i/) у [Lean](https://lean-lang.org/). Формалізація має на меті максимально точно перефразувати оригінальний текст, а також продемонструвати особливості та синтаксис Lean. Зокрема, формалізація _не_ оптимізована під ефективність, а в деяких випадках може відхилятися від ідіоматичного використання Lean.

Частини тексту, залишені як вправи для читача, у цьому перекладі передаються як тактика `sorry`. Читачі можуть створити форк репозиторію, щоб спробувати свої сили у виконанні цих вправ, але я не маю наміру розміщувати рішення безпосередньо в цьому репозиторії.

Хоча розташування визначень, теорем і доказів тут є близьким перефразуванням підручника, я утримуюся від прямого цитування матеріалу з підручника, натомість наводжу посилання на оригінальний текст, де це доречно. Таким чином, цю формалізацію слід розглядати як анотоване доповнення до основного тексту, а не як його заміну.

Значна частина матеріалу в цьому тексті продубльована у стандартній математичній бібліотеці Lean [Mathlib](https://leanprover-community.github.io/mathlib4_docs/), хоча й з дещо іншими визначеннями. Щоб усунути ці розбіжності, ця формалізація поступово переходитиме від визначень, наданих підручником, до визначень, наданих Mathlib, у міру просування в тексті, жертвуючи таким чином самодостатністю формалізації на користь сумісності з Mathlib. Наприклад, у розділі 2 розвивається теорія натуральних чисел незалежно від Mathlib, але в усіх наступних розділах замість неї використовуватимуть натуральні числа Mathlib. (Епілог до розділу 2 надається, щоб показати, що два поняття натуральних чисел ізоморфні.) Таким чином, цю формалізація також може бути використана як вступ до різних частин Mathlib.

Для узгодження формалізації з домовленостями Mathlib, до деяких визначень було внесено невелику кількість технічних змін порівняно з версією підручника. Найбільш помітні:
- Послідовності індексуються з нуля, а не з одиниці, оскільки Mathlib має набагато більше підтримки для натуральних чисел `ℕ` з нульовою нумерацією, ніж для натуральних чисел з одиничною нумерацією.
- Багатьом операціям, які залишилися невизначеними в тексті, таким як ділення на нуль або отримання формальної границі не-Коші послідовності, замість цього присвоюється "сміттєве" значення (наприклад, `0`), щоб зробити операцію повністю визначеною. Це пояснюється тим, що Lean має кращу підтримку повних функцій *(пр.перекл. total functions)*, ніж часткових функцій *(пр.перекл. partial functions)* (нерозбірливе використання останніх може призвести до "пекла залежних типів", в якому навіть дуже прості маніпуляції вимагають досить тонких і делікатних доказів). Дивіться, наприклад, [цю публікацію в блозі](https://xenaproject.wordpress.com/2020/07/05/division-by-zero-in-type-theory-a-faq/) Кевіна Баззарда для отримання додаткової інформації.

Поточні формалізовані розділи:

- [Розділ 2.1: Аксіоми Пеано](./sec21/)
- [Розділ 2.2: Додавання](./sec22/)
- [Розділ 2.3: Множення](./sec23/)
- [Розділ 2, Епілог: Ізоморфізм із натуральними числами Mathlib](./sec2e)
- [Розділ 3.1: Основи теорії множин](./sec31/)
- [Розділ 3.2: Парадок Рассела](./sec32/)
- [Розділ 3.3: Функції](./sec33/)
- [Розділ 3.4: Образи та прообрази](./sec34/)
- [Розділ 3.5: Декартов добуток](./sec35/)
- [Розділ 3.6: Потужність множин](./sec36/)
- [Розділ 3, Епілог: Зв'язки із ZFSet](./sec3e/)
- [Розділ 4.1: Цілі числа](./sec41/)
- [Розділ 4.2: Раціональні числа](./sec42/)
- [Розділ 4.3: Абсолютні значення та піднесення до степеня](./sec43/)
- [Розділ 4.4: Прогалини у раціональних числах](./sec44/)
- [Розділ 5.1: Послідовності Коші раціональних числах](./sec51)
- [Розділ 5.2: Еквівалентні послідовності Коші](./sec52/)
- [Розділ 5.3: Побудова дійсних чисел](./sec53/)
- [Розділ 5.4: Впорядкування дійсних чисел](./sec54/)
- [Розділ 5.5: Властивість найменшої верхньої межі](./sec55/)
- [Розділ 5.6: Піднесення дійсних чисел до степеня, частина I](./sec56/)
- [Розділ 5, Епілог: Ізоморфізм із дійсними числами Mathlib](./sec5e/)
- [Розділ 6.1: Збіжність і правила границь](./sec61/)
- [Розділ 6.2: Розширена система дійсних чисел](./sec62/)
- [Розділ 6.3: Супремуми та інфімуми послідовностей](./sec63/)
- [Розділ 6.4: Верхні/нижні границі послідовностей і граничні точки](./sec64/)
- [Розділ 6.5: Деякі стандартні границі](./sec65/)
- [Розділ 6.6: Підпослідовності](./sec66/)
- [Розділ 6, Епілог: Зв'язки з операціями границь у Mathlib](./sec6e/)
- [Розділ 7.1: Скінченні ряди](./sec71/)
- [Розділ 7.2: Нескінченні ряди](./sec72/)
- [Розділ 7.3: Суми невід'ємних чисел](./sec73/)
- [Розділ 7.4: Перестановка рядів](./sec74/)
- [Розділ 7.5: Ознаки кореня та відношення](./sec75/)
- [Розділ 8.1: Зліченість](./sec81/)
- [Розділ 8.2: Підсумовування на нескінченних множинах](./sec82/)
- [Розділ 8.3: Незліченні множини](./sec83/)
- [Розділ 8.4: Аксіома вибору](./sec84/)
- [Розділ 8.5: Упорядковані множини](./sec85/)
- [Розділ 9.1: Підмножини дійсної прямої](./sec91/)
- [Розділ 9.2: Алгебра дійснозначних функцій](./sec92/)
- [Розділ 9.3: Граничні значення функцій](./sec93/)
- [Розділ 9.4: Неперервні функції](./sec94/)
- [Розділ 9.5: Ліві та праві границі](./sec95/)
- [Розділ 9.6: Принцип максимуму](./sec96/)
- [Розділ 9.7: Теорема про проміжне значення](./sec97/)
- [Розділ 9.8: Монотонні функції](./sec98/)
- [Розділ 9.9: Рівномірна неперервність](./sec99/)
- [Розділ 9.10: Границі на нескінченності](./sec910/)
- [Розділ 10.1: Базові визначення](./sec101/)
- [Розділ 10.2: Локальні максимуми, локальні мінімуми та похідні](./sec102/)
- [Розділ 10.3: Монотонні функції та похідні](./sec103/)
- [Розділ 10.4: Обернені функції та похідні](./sec104/)
- [Розділ 10.5: Правило Лопіталя](./sec105/)
- [Розділ 11.1: Розбиття](./sec111/)
- [Розділ 11.2: Кусочно-постійні функції](./sec112/)
- [Розділ 11.3: Верхній та нижній інтеграл Рімана](./sec113/)
- [Розділ 11.4: Основні властивості інтегралу Рімана](./sec114/)
- [Розділ 11.5: Ріманова інтегровність неперервних функцій](./sec115/)
- [Розділ 11.6: Ріманова інтегровність монотонних функцій](./sec116/)
- [Розділ 11.7: Функція, яка не інтегровна за Ріманом](./sec117/)
- [Розділ 11.8: Інтеграл Рімана–Стєльтьєса](./sec118/)
- [Розділ 11.9: Дві фундаментальні теореми математичного аналізу](./sec119/)
- [Розділ 11.10: Наслідки фундаментальних теорем](./sec1110/)
- [Додаток A.1: Математичні твердження](./secA1/)
- [Додаток A.2: Наслідки](./secA2/)
- [Додаток A.3: Структура доказів](./secA3/)
- [Додаток A.4: Змінні та квантифікатори](./secA4/)
- [Додаток A.5: Вкладені квантифікатори](./secA5/)
- [Додаток A.6: Деякі приклади доказів та квантифікаторів](./secA6/)
- [Додаток A.7: Рівність](./secA7/)
- [Додаток B.1: Десяткове подання натуральних чисел](./appB1/)
- [Додаток B.2: Десяткове подання дійсних чисел](./appB2/)
