import VersoBlog
open Verso Genre Blog

#doc (Page) " Часткова формалізація в Lean книги Аналіз I" =>

Файли в цьому каталозі містять формалізацію вибраних частин мого *(пр.перекл. тут і далі це Терренс Тао)* тексту [_Аналіз I_](https://terrytao.wordpress.com/books/analysis-i/) у [Lean](https://lean-lang.org/). Формалізація має на меті максимально точно перефразувати оригінальний текст, а також продемонструвати особливості та синтаксис Lean. Зокрема, формалізація _не_ оптимізована під ефективність, а в деяких випадках може відхилятися від ідіоматичного використання Lean.

Частини тексту, залишені як вправи для читача, у цьому перекладі передаються як тактика `sorry`. Читачі можуть створити форк репозиторію, щоб спробувати свої сили у виконанні цих вправ, але я не маю наміру розміщувати рішення безпосередньо в цьому репозиторії.

Хоча розташування визначень, теорем і доказів тут є близьким перефразуванням підручника, я утримуюся від прямого цитування матеріалу з підручника, натомість наводжу посилання на оригінальний текст, де це доречно. Таким чином, цю формалізацію слід розглядати як анотоване доповнення до основного тексту, а не як його заміну.

Значна частина матеріалу в цьому тексті продубльована у стандартній математичній бібліотеці Lean [Mathlib](https://leanprover-community.github.io/mathlib4_docs/), хоча й з дещо іншими визначеннями. Щоб усунути ці розбіжності, ця формалізація поступово переходитиме від визначень, наданих підручником, до визначень, наданих Mathlib, у міру просування в тексті, жертвуючи таким чином самодостатністю формалізації на користь сумісності з Mathlib. Наприклад, у розділі 2 розвивається теорія натуральних чисел незалежно від Mathlib, але в усіх наступних розділах замість неї використовуватимуть натуральні числа Mathlib. (Епілог до розділу 2 надається, щоб показати, що два поняття натуральних чисел ізоморфні.) Таким чином, цю формалізація також може бути використана як вступ до різних частин Mathlib.

Для узгодження формалізації з домовленостями Mathlib, до деяких визначень було внесено невелику кількість технічних змін порівняно з версією підручника. Найбільш помітні:
- Послідовності індексуються з нуля, а не з одиниці, оскільки Mathlib має набагато більше підтримки для натуральних чисел `ℕ` з нульовою нумерацією, ніж для натуральних чисел з одиничною нумерацією.
- Багатьом операціям, які залишилися невизначеними в тексті, таким як ділення на нуль або отримання формальної границі не-Коші послідовності, замість цього присвоюється "сміттєве" значення (наприклад, `0`), щоб зробити операцію повністю визначеною. Це пояснюється тим, що Lean має кращу підтримку повних функцій *(пр.перекл. total functions)*, ніж часткових функцій *(пр.перекл. partial functions)* (нерозбірливе використання останніх може призвести до "пекла залежних типів", в якому навіть дуже прості маніпуляції вимагають досить тонких і делікатних доказів). Дивіться, наприклад, [цю публікацію в блозі](https://xenaproject.wordpress.com/2020/07/05/division-by-zero-in-type-theory-a-faq/) Кевіна Баззарда для отримання додаткової інформації.

Поточні формалізовані розділи:

- [Розділ 2.1: Аксіоми Пеано](./sec21/)
- [Розділ 2.2: Додавання](./sec22/)
- [Розділ 2.3: Множення](./sec23/)
- [Розділ 2, Епілог: Ізоморфізм із натуральними числами Mathlib](./sec2e)
- [Розділ 3.1: Основи теорії множин](./sec31/)
- [Розділ 3.2: Парадок Рассела](./sec32/)
- [Розділ 3.3: Функції](./sec33/)
- [Розділ 3.4: Образи та прообрази](./sec34/)
- [Розділ 3.5: Декартов добуток](./sec35/)
- [Розділ 3.6: Потужність множин](./sec36/)
- [Розділ 3, Епілог: Зв'язки із ZFSet](./sec3e/)
- [Розділ 4.1: Цілі числа](./sec41/)
- [Розділ 4.2: Раціональні числа](./sec42/)
- [Розділ 4.3: Абсолютні значення та піднесення до степеня](./sec43/)
- [Розділ 4.4: Прогалини у раціональних числах](./sec44/)
- [Розділ 5.1: Послідовності Коші раціональних числах](./sec51)
- [Розділ 5.2: Еквівалентні послідовності Коші](./sec52/)
- [Розділ 5.3: Побудова дійсних чисел](./sec53/)
- [Розділ 5.4: Впорядкування дійсних чисел](./sec54/)
- [Розділ 5.5: Властивість найменшої верхньої межі](./sec55/)
- [Розділ 5.6: Піднесення дійсних чисел до степеня, частина I](./sec56/)
- [Розділ 5, Епілог: Ізоморфізм із дійсними числами Mathlib](./sec5e/)
- [Розділ 6.1: Convergence and limit laws](./sec61/)
- [Розділ 6.2: The extended real number system](./sec62/)
- [Розділ 6.3: Suprema and Infima of sequences](./sec63/)
- [Розділ 6.4: Lim inf, lim sup, and limit points](./sec64/)
- [Розділ 6.5: Some standard limits](./sec65/)
- [Розділ 6.6: Subsequences](./sec66/)
- [Розділ 6 epilogue: Connections with Mathlib limits](./sec6e/)
- [Розділ 7.1: Finite series](./sec71/)
- [Розділ 7.2: Infinite series](./sec72/)
- [Розділ 7.3: Sums of non-negative numbers](./sec73/)
- [Розділ 7.4: Rearrangement of series](./sec74/)
- [Розділ 7.5: The root and ratio tests](./sec75/)
- [Розділ 8.1: Countability](./sec81/)
- [Розділ 8.2: Summation on infinite sets](./sec82/)
- [Розділ 8.3: Uncountable sets](./sec83/)
- [Розділ 8.4: The axiom of choice](./sec84/)
- [Розділ 8.5: Ordered sets](./sec85/)
- [Розділ 9.1: Subsets of the real line](./sec91/)
- [Розділ 9.2: The algebra of real-valued functions](./sec92/)
- [Розділ 9.3: Limiting values of functions](./sec93/)
- [Розділ 9.4: Continuous functions](./sec94/)
- [Розділ 9.5: Left and right limits](./sec95/)
- [Розділ 9.6: The maximum principle](./sec96/)
- [Розділ 9.7: The intermediate value theorem](./sec97/)
- [Розділ 9.8: Monotone functions](./sec98/)
- [Розділ 9.9: Uniform continuity](./sec99/)
- [Розділ 9.10: Limits at infinity](./sec910/)
- [Розділ 10.1: Basic definitions](./sec101/)
- [Розділ 10.2: Local extrema and derivatives](./sec102/)
- [Розділ 10.3: Monotone functions and derivatives](./sec103/)
- [Розділ 10.4: The inverse function theorem](./sec104/)
- [Розділ 10.5: L'Hôpital's rule](./sec105/)
- [Розділ 11.1: Partitions](./sec111/)
- [Розділ 11.2: Piecewise constant functions](./sec112/)
- [Розділ 11.3: Upper and lower Riemann integrals](./sec113/)
- [Розділ 11.4: Basic properties of the Riemann integral](./sec114/)
- [Розділ 11.5: Riemann integrability of continuous functions](./sec115/)
- [Розділ 11.6: Riemann integrability of monotone functions](./sec116/)
- [Розділ 11.7: A non-Riemann integrable function](./sec117/)
- [Розділ 11.8: The Riemann-Stieltjes integral](./sec118/)
- [Розділ 11.9: The two fundamental theorems of calculus](./sec119/)
- [Розділ 11.10: The fundamental theorem of calculus](./sec1110/)
- [Додаток A.1: Mathematical statements](./secA1/)
- [Додаток A.2: Implications](./secA2/)
- [Додаток A.3: The structure of proofs](./secA3/)
- [Додаток A.4: Variables and quantifiers](./secA4/)
- [Додаток A.5: Nested quantifiers](./secA5/)
- [Додаток A.6: Some examples of proofs and quantifiers](./secA6/)
- [Додаток A.7: Equality](./secA7/)
- [Додаток B.1: The decimal representation of natural numbers](./appB1/)
- [Додаток B.2: The decimal representation of real numbers](./appB2/)
